{ "_id" : { "$oid" : "550cabe2a52b58030076342f" }, "moniker" : "Marilyn Monroe", "category1" : "Actor", "category2" : "Model", "category3" : "Wife of Joe DiMaggio and Arthur Miller", "lastName" : "Baker", "firstName" : "Norma", "middleName" : "Jeane", "birth" : "19260601", "death" : "19620805", "age" : "36", "bio" : "Marilyn Monroe (born Norma Jeane Mortenson; June 1, 1926 – August 5, 1962) was an American actress, model, and singer, who became a major sex symbol, starring in a number of commercially successful motion pictures during the 1950s and early 1960s.", "photoLink" : "http://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Marilyn_Monroe_-_publicity.JPG/220px-Marilyn_Monroe_-_publicity.JPG", "burialCoords" : "34.05847, -118.43979", "burialAddy" : "1218 Glendon Avenue", "burialCity" : "Los Angeles", "burialState" : "CA", "burialZIP" : "90024", "burialCountry" : "USA", "burialFacility" : "Westwood Village Memorial Park Cemetery", "howDied" : "Overdose", "__v" : 0 }
{ "_id" : { "$oid" : "550d8b3075959603008163bf" }, "moniker" : "Jimi Hendrix", "category1" : "Musician", "lastName" : "Hendrix", "firstName" : "Johnny", "middleName" : "Allen", "birth" : "19421127", "death" : "19700918", "age" : "27", "bio" : "James Marshall \"Jimi\" Hendrix (born Johnny Allen Hendrix; November 27, 1942 – September 18, 1970) was an American guitarist, singer, and songwriter. Although his mainstream career spanned only four years, he is widely regarded as one of the most influential electric guitarists in the history of popular music, and one of the most celebrated musicians of the 20th century. The Rock and Roll Hall of Fame describes him as \"arguably the greatest instrumentalist in the history of rock music\"", "photoLink" : "http://upload.wikimedia.org/wikipedia/commons/thumb/a/ae/Jimi_Hendrix_1967.png/220px-Jimi_Hendrix_1967.png", "burialCity" : "Renton", "burialState" : "WA", "burialFacility" : "Greenwood Cemetery", "howDied" : "asphyxia while intoxicated with barbiturates", "burialCoords" : "47.486505,-122.173977", "burialAddy" : "350 Monroe Ave NE", "burialZIP" : "98056", "burialCountry" : "USA", "__v" : 0 }
{ "_id" : { "$oid" : "550e1d7b91d7bb030008eb48" }, "moniker" : "Steve Jobs", "category1" : "entrepreneur", "category2" : "marketer", "category3" : "inventor", "lastName" : "Jobs", "firstName" : "Steven", "middleName" : "Paul", "birth" : "19550224", "death" : "20111005", "age" : "56", "bio" : "Steven Paul Jobs (/ˈdʒɒbz/; February 24, 1955 – October 5, 2011) was an American entrepreneur, marketer, and inventor, who was the cofounder, chairman, and CEO of Apple Inc. Through Apple, he is widely recognized as a charismatic and design-driven pioneer of the personal computer revolution and for his influential career in the computer and consumer electronics fields, transforming \"one industry after another, from computers and smartphones to music and movies.\" Jobs served as chief executive of Pixar Animation Studios; he became a member of the board of directors of The Walt Disney Company in 2006, when Disney acquired Pixar. Jobs was among the first to see the commercial potential of Xerox PARC's mouse-driven graphical user interface, which led to the creation of the Apple Lisa and a year later, the Macintosh. He played a role in introducing the LaserWriter, the first laser printer to feature vector graphics that started desktop publishing to the market.", "photoLink" : "http://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Steve_Jobs_Headshot_2010-CROP.jpg/440px-Steve_Jobs_Headshot_2010-CROP.jpg", "burialAddy" : "695 Arastradero Rd", "burialCity" : "Palo Alto", "burialState" : "CA", "burialZIP" : "94306", "burialCountry" : "USA", "burialFacility" : "Alta Mesa Memorial Park", "burialCoords" : "37.3990997, -122.12961580000001", "howDied" : "pancreatic cancer", "__v" : 0 }
{ "_id" : { "$oid" : "550e214291d7bb030008eb49" }, "moniker" : "John Lennon", "category1" : "musician", "category2" : "singer", "category3" : "songwriter", "lastName" : "Lennon", "firstName" : "John", "middleName" : "Winston", "birth" : "19401009", "death" : "19801208", "howDied" : "shooting", "age" : "40", "photoLink" : "http://upload.wikimedia.org/wikipedia/commons/5/51/JohnLennonpeace.jpg", "burialAddy" : "Central Park, New York City, NY, United States", "burialCoords" : "40.782865, -73.96535499999999", "burialCity" : "New York City", "burialState" : "NY", "burialCountry" : "USA", "burialZIP" : "10022", "bio" : "John Winston Ono Lennon, MBE, born John Winston Lennon; (9 October 1940 – 8 December 1980), was an English musician, singer and songwriter who rose to worldwide fame as a founder member of the rock band the Beatles, the most commercially successful band in the history of popular music. With Paul McCartney, he formed a songwriting partnership that is one of the most celebrated of the 20th century.  Born and raised in Liverpool, as a teenager Lennon became involved in the skiffle craze; his first band, the Quarrymen, evolved into the Beatles in 1960. When the group disbanded in 1970, Lennon embarked on a solo career that produced the critically acclaimed albums John Lennon/Plastic Ono Band and Imagine, and iconic songs such as \"Give Peace a Chance\" and \"Working Class Hero\". After his marriage to Yoko Ono in 1969, he changed his name to John Ono Lennon. Lennon disengaged himself from the music business in 1975 to raise his infant son Sean, but re-emerged with Ono in 1980 with the new album Double Fantasy. He was murdered three weeks after its release.", "__v" : 0 }
{ "_id" : { "$oid" : "5510ec604a13ed03002a17a5" }, "moniker" : "Robin Williams", "category1" : "Actor", "lastName" : "Williams", "firstName" : "Robin", "middleName" : "McLaurin", "birth" : "19510721", "death" : "20140811", "howDied" : "suicide", "age" : "63", "photoLink" : "http://upload.wikimedia.org/wikipedia/commons/0/05/Robin_Williams_2011a_%282%29.jpg", "burialAddy" : "Ashes spread in San Francisco Bay", "burialCoords" : "37.869887, -122.408185", "burialCity" : "San Francisco", "burialState" : "CA", "burialCountry" : "USA", "burialZIP" : "94920", "bio" : "Robin McLaurin Williams (July 21, 1951 – August 11, 2014) was an American actor and comedian. Starting as a stand-up comedian in San Francisco and Los Angeles in the mid-1970s, he is credited with leading San Francisco's comedy renaissance. After rising to fame as Mork in the sitcom Mork & Mindy (1978–82), Williams went on to establish a career in both stand-up comedy and feature film acting. He was known for his improvisational skills.After his film debut in the musical comedy Popeye (1980), he starred or co-starred in widely acclaimed films, including the comedy-drama The World According to Garp (1982), the war comedy Good Morning, Vietnam (1987), the dramas Dead Poets Society (1989) and Awakenings (1990), the comedy-drama The Fisher King (1991), a voice role in the Disney animated musical fantasy Aladdin (1992), the drama Good Will Hunting (1997), and the psychological thriller One Hour Photo (2002), as well as financial successes such as the fantasy adventure film Hook (1991), the comedy Mrs. Doubtfire (1993), the fantasy adventure Jumanji (1995), the comedy The Birdcage (1996), and the fantasy adventure-comedy Night at the Museum (2006).In 1998, Williams won the Academy Award for Best Supporting Actor for his performance as Dr. Sean Maguire in Good Will Hunting. He also received two Primetime Emmy Awards, six Golden Globe Awards, two Screen Actors Guild Awards, and four Grammy Awards throughout his career.On August 11, 2014, after a long history of depression, Williams committed suicide at his home in Paradise Cay, Marin County, California.", "__v" : 0 }
{ "_id" : { "$oid" : "5510eca64a13ed03002a17a6" }, "moniker" : "Philip Seymour Hoffman", "category1" : "Actor", "lastName" : "Hoffman", "firstName" : "Philip", "middleName" : "Seymour", "birth" : "19670723", "death" : "20140202", "age" : "46", "bio" : "Philip Seymour Hoffman (July 23, 1967 – February 2, 2014) was an American actor, director, and producer of film and theater. Best known for his supporting and character roles – typically lowlifes, bullies, and misfits – Hoffman was a regular presence in films from the early 1990s until his death at age 46. Drawn to theater as a teenager, Hoffman studied acting at New York University's Tisch School of the Arts. He began his screen career in a 1991 episode of Law & Order and started to appear in films in 1992. He gained recognition for his supporting work throughout the decade, notably in Boogie Nights (1997), Happiness (1998), The Big Lebowski (1998), and The Talented Mr. Ripley (1999). He began to occasionally play leading roles, and for his portrayal of the author Truman Capote in Capote (2005), won multiple accolades including the Academy Award for Best Actor. Hoffman's profile continued to grow, and he received three more Oscar nominations for his supporting work as a brutally frank CIA officer in Charlie Wilson's War (2007), a priest accused of pedophilia in Doubt (2008), and the charismatic leader of a Scientology-type movement in The Master (2012). While he mainly worked in independent films, including The Savages (2007) and Synecdoche, New York (2008), Hoffman also appeared in Hollywood blockbusters, such as Twister (1996) and Mission: Impossible III (2006), and one of his final roles was Plutarch Heavensbee in the Hunger Games series (2013–15). The feature Jack Goes Boating (2010) marked his debut as a filmmaker. Hoffman was also an accomplished theater actor and director. He joined the off-Broadway LAByrinth Theater Company in 1995, where he directed, produced, and appeared in numerous stage productions. His performances in three Broadway plays – True West (2000), Long Day's Journey into Night (2003), and Death of a Salesman (2012) – all led to Tony Award nominations.Hoffman struggled with drug addiction as a young adult, and relapsed in 2013 after many years of sobriety. In February 2014, he died of combined drug intoxication – an unexpected event that was widely lamented by the film and theater communities. Remembered for his fearlessness in playing reprehensible characters, and for bringing depth and humanity to such roles, Hoffman was described in his New York Times obituary as \"perhaps the most ambitious and widely admired American actor of his generation\".", "photoLink" : "http://upload.wikimedia.org/wikipedia/commons/thumb/f/f5/Philip_Seymour_Hoffman_2011.jpg/440px-Philip_Seymour_Hoffman_2011.jpg", "burialFacility" : "Cremated, Ashes given to family or friend", "howDied" : "Acute mixed drug intoxication", "__v" : 0 }
{ "_id" : { "$oid" : "5510ecd84a13ed03002a17a7" }, "moniker" : "Heath Ledger", "category1" : "Actor", "lastName" : "Ledger", "firstName" : "Heath", "birth" : "19790404", "middleName" : "Andrew", "death" : "20080122", "age" : "28", "bio" : "Heath Andrew Ledger (4 April 1979 – 22 January 2008) was an Australian actor and director. After performing roles in Australian television and film during the 1990s, Ledger left for the United States in 1998 to develop his film career. His work comprised nineteen films, including 10 Things I Hate About You (1999), The Patriot (2000), A Knight's Tale (2001), Monster's Ball (2001), Ned Kelly (2003), The Brothers Grimm (2005), Lords of Dogtown (2005), Brokeback Mountain (2005), Casanova (2005), Candy (2006), I'm Not There (2007), The Dark Knight (2008), and The Imaginarium of Doctor Parnassus (2009). He also produced and directed music videos and aspired to be a film director. For his portrayal of Ennis Del Mar in Brokeback Mountain, Ledger won the New York Film Critics Circle Award for Best Actor and Best International Actor from the Australian Film Institute, and was nominated for the BAFTA Award for Best Actor in a Leading Role and for the Academy Award for Best Actor. Posthumously he shared the 2007 Independent Spirit Robert Altman Award with the rest of the ensemble cast, the director, and the casting director for the film I'm Not There, which was inspired by the life and songs of American singer-songwriter Bob Dylan. In the film, Ledger portrayed a fictional actor named Robbie Clark, one of six characters embodying aspects of Dylan's life and persona. Ledger died on 22 January 2008 from an accidental intoxication from prescription drugs. A few months before his death, Ledger had finished filming his performance as the Joker in The Dark Knight. His death occurred during editing of The Dark Knight and in the midst of filming his last role as Tony in The Imaginarium of Doctor Parnassus. His untimely death cast a somber shadow over the subsequent promotion of the $185 million Batman production. Ledger received numerous posthumous accolades for his critically acclaimed performance in the film, including the Academy Award for Best Supporting Actor, a Best Actor International Award at the 2008 Australian Film Institute Awards (for which he became the first actor to win an award posthumously), the 2008 Los Angeles Film Critics Association Award for Best Supporting Actor, the 2009 Golden Globe Award for Best Supporting Actor – Motion Picture, and the 2009 BAFTA Award for Best Supporting Actor.", "photoLink" : "http://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Heath_Ledger.jpg/440px-Heath_Ledger.jpg", "burialCity" : "Karrakatta", "burialFacility" : "Karrakatta Cemetery and Crematorium - Ashes scattered at the site of his Grandparent's gravesite.", "howDied" : "Drug overdose, ruled accidental", "burialCoords" : "-31.96973,115.8004045", "burialCountry" : "Australia", "__v" : 0 }
{ "_id" : { "$oid" : "5510ed154a13ed03002a17a8" }, "moniker" : "Bob Hoskins", "category1" : "Actor", "lastName" : "Hoskins", "firstName" : "Robert", "birth" : "19421126", "middleName" : "William", "death" : "20140429", "age" : "71", "bio" : "Robert William \"Bob\" Hoskins (26 October 1942 – 29 April 2014) was an English actor, known for playing Cockneys and gangsters. His best known works include lead roles in The Long Good Friday (1980), Mona Lisa (1986), Who Framed Roger Rabbit (1988), Mermaids (1990), Super Mario Bros. (1993), and supporting performances in Brazil (1985), Hook (1991), Nixon (1995), Mrs. Henderson Presents (2005), A Christmas Carol (2009), Made in Dagenham (2010), and Snow White and the Huntsman (2012). Hoskins received the prestigious Prix d'interprétation masculine, and won the BAFTA Award for Best Actor in a Leading Role and the Golden Globe Award for Best Actor – Motion Picture Drama for his role in Mona Lisa. He was also nominated for the Academy Award for Best Actor for the same role. In 2009, he won an International Emmy Award for Best Actor for his appearance on the BBC One drama The Street.", "photoLink" : "http://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Bob_hoskins_filming_ruby_blue_cropped.jpg/440px-Bob_hoskins_filming_ruby_blue_cropped.jpg", "burialFacility" : "Unknown", "howDied" : "Pneumonia", "__v" : 0 }
{ "_id" : { "$oid" : "5510ed714a13ed03002a17a9" }, "moniker" : "James Gandolfini", "category1" : "Actor", "lastName" : "Gandolfini", "firstName" : "James", "birth" : "19421127", "middleName" : "Joseph", "suffix" : "Jr", "death" : "20130619", "age" : "51", "bio" : "James Joseph Gandolfini, Jr. (September 18, 1961 – June 19, 2013) was an American actor and producer. Gandolfini was best known for his role as Tony Soprano, an American Mafia boss in the HBO series The Sopranos. He garnered enormous praise for this performance, winning three Emmy Awards, three Screen Actors Guild Awards, and one Golden Globe Award for Best Actor in a Drama Series. His other notable roles included woman-beating mob henchman Virgil in True Romance (1993), enforcer and stuntman Bear in Get Shorty (1995), and impulsive \"Wild Thing\" Carol in Where the Wild Things Are (2009). After finishing The Sopranos, Gandolfini produced the documentary Alive Day Memories: Home from Iraq (2007), in which he interviewed injured Iraq War veterans. His second documentary, Wartorn: 1861–2010 (2010), analyzed the impact of posttraumatic stress disorder on soldiers and families throughout several wars in American history from 1861 to 2010.", "photoLink" : "http://upload.wikimedia.org/wikipedia/commons/thumb/0/03/JamesGandolfiniSept11TIFF.jpg/440px-JamesGandolfiniSept11TIFF.jpg", "burialFacility" : "Cremated, Ashes given to family or friend", "howDied" : "Heart attack", "__v" : 0 }
{ "_id" : { "$oid" : "5510edbf4a13ed03002a17aa" }, "moniker" : "John Ritter", "category1" : "Actor", "lastName" : "Ritter", "firstName" : "Jonathan", "birth" : "19421127", "middleName" : "Southworth", "death" : "20030911", "age" : "54", "bio" : "Jonathan Southworth \"John\" Ritter (September 17, 1948 – September 11, 2003) was an American actor, comedian, and voice-over artist. Ritter was best known for playing Jack Tripper on the hit ABC sitcom Three's Company, for which he won an Emmy and a Golden Globe Award in 1984. He was the son of famous country/western star Tex Ritter, and the father of actors Jason Ritter and Tyler Ritter. Ritter appeared in hundreds of films and television shows/episodes combined (and performed on Broadway), including It (1990), Problem Child (1990), Problem Child 2 (1991) and Bad Santa in 2003 (his final live action film which was dedicated to his memory). Prior to Clifford's Really Big Movie (posthumously released), Ritter received four Daytime Emmy Award nominations for his voice work on the children's television series, Clifford the Big Red Dog, in addition to many other awards Ritter was nominated for or won. Don Knotts called Ritter the \"greatest physical comedian on the planet\". Ritter died from an aortic dissection on September 11, 2003. His death occurred shortly after the production of an episode for the second season of 8 Simple Rules.", "photoLink" : "http://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/John_Ritter_at_the_1988_Emmy_Awards.jpg/440px-John_Ritter_at_the_1988_Emmy_Awards.jpg", "burialCity" : "Glendale", "burialState" : "CA", "burialFacility" : "Forest Lawn Memorial Park", "howDied" : "Aortic dissection", "burialCoords" : "34.14408, -118.31772", "burialAddy" : "1712 S Glendale Ave", "burialZIP" : "91205", "burialCountry" : "USA", "__v" : 0 }
{ "_id" : { "$oid" : "5510ee304a13ed03002a17ab" }, "moniker" : "Brittany Murphy", "category1" : "Actor", "lastName" : "Bertolotti", "firstName" : "Brittany", "birth" : "19771110", "middleName" : "Anne", "death" : "20091220", "age" : "32", "bio" : "Brittany Murphy-Monjack (born Brittany Anne Bertolotti; November 10, 1977 – December 20, 2009), known professionally as Brittany Murphy, was an American film and stage actress, singer, and voice artist. Murphy, a native of Atlanta, moved to Los Angeles as a teenager, and pursued a career in acting. Her breakthrough role was in Amy Heckerling's Clueless (1995), followed by supporting roles in independent films such as Freeway (1996) and Bongwater (1998). She made her stage debut in a Broadway production of Arthur Miller's A View from the Bridge in 1997, and then appeared in James Mangold's drama Girl, Interrupted (1999), as well as the satire Drop Dead Gorgeous (1999). The 2000s saw Murphy with roles in Don't Say a Word (2001) alongside Michael Douglas, and alongside Eminem in Curtis Hanson's 8 Mile (2002), for which she gained critical recognition. Her later roles included Riding in Cars with Boys (2001), the dark comedy crime film Spun (2002), Uptown Girls (2003) alongside Dakota Fanning, Sin City (2005), and Happy Feet (2006). Murphy also voiced Luanne Platter on the animated TV series King of the Hill. Her final film, Something Wicked, was released in April 2014.", "photoLink" : "http://upload.wikimedia.org/wikipedia/commons/thumb/1/1f/Brittany_Murphy_Happy_Feet_Premiere_2006.jpg/440px-Brittany_Murphy_Happy_Feet_Premiere_2006.jpg", "burialCity" : "Los Angeles", "burialState" : "CA", "burialFacility" : "Forest Lawn Memorial Park", "howDied" : "Pneumonia and anemia", "burialCoords" : "34.14414, -118.31979", "burialAddy" : "6300 Forest Lawn Dr", "burialZIP" : "90068", "burialCountry" : "USA", "__v" : 0 }
{ "_id" : { "$oid" : "5512eda5e6a63b0300ce1c02" }, "moniker" : "Richard Dawson", "howDied" : "Esophageal cancer", "category1" : "Actor", "category2" : "Comedian", "category3" : "Game Show Host", "lastName" : "Emm", "firstName" : "Colin", "middleName" : "Lionel", "birth" : "19321120", "death" : "20120602", "age" : "79", "bio" : "Richard Dawson (born Colin Lionel Emm; November 20, 1932 – June 2, 2012) was an English-American actor and comedian, and a game show host and panelist in the United States.  Dawson was well known for playing Corporal Peter Newkirk on Hogan's Heroes, being the original host of the Family Feud game show from 1976 to 1985 and from 1994 to 1995, and a regular panelist on the 1970s version of Match Game on CBS from 1973 to 1978. After a successful career in British television and cinema, Dawson moved to Los Angeles. In 1984, he became an American citizen while retaining his British Citizenship.  In 2012, Dawson died of complications from esophageal cancer. He is buried at Westwood Memorial Park in Los Angeles.", "photoLink" : "http://upload.wikimedia.org/wikipedia/commons/f/f9/Richard_Dawson_Hogan_Hero_headshot_1963.png", "burialAddy" : "1218 Glendon Avenue", "burialCity" : "Los Angeles", "burialState" : "CA", "burialZIP" : "90024", "burialCountry" : "USA", "burialFacility" : "Pierce Brothers Westwood Village Memorial Park", "burialCoords" : "34.058321,-118.441318", "__v" : 0 }
